# Criando os Nomes

In [1]:
import pandas as pd

In [8]:
nomes_f = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f')
nomes_m = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m')

In [9]:
nomes_f

          nome  regiao      freq  rank sexo
0        MARIA       0  11694738     1    F
1          ANA       0   3079729     2    F
2    FRANCISCA       0    721637     3    F
3      ANTONIA       0    588783     4    F
4      ADRIANA       0    565621     5    F
..         ...     ...       ...   ...  ...
195     ROSANE       0     82203   196    F
196    IVONETE       0     81878   197    F
197    LUCIANE       0     81230   198    F
198    ISADORA       0     81100   199    F
199      NILZA       0     80128   200    F

[200 rows x 5 columns]

In [10]:
nomes_m

          nome  regiao     freq  rank sexo
0         JOSE       0  5732508     1    M
1         JOAO       0  2971935     2    M
2      ANTONIO       0  2567494     3    M
3    FRANCISCO       0  1765197     4    M
4       CARLOS       0  1483121     5    M
..         ...     ...      ...   ...  ...
195     WALTER       0    67207   196    M
196    ARLINDO       0    66669   197    M
197    MICHAEL       0    65736   198    M
198     ALVARO       0    65444   199    M
199    GEOVANE       0    65435   200    M

[200 rows x 5 columns]

In [12]:
print(f'Quant nomes: {len(nomes_f) + len(nomes_m)}')

Quant nomes: 400

In [13]:
frames = [nomes_f, nomes_m]

In [19]:
nomes = pd.concat(frames)['nome'].to_frame()

In [20]:
nomes.sample(5)

        nome
29    RENATA
64   VIVIANE
40    SERGIO
60      SARA
122   CINTIA

# Incluindo ID dos alunos

In [22]:
import numpy as np
np.random.seed(123)

In [23]:
total_alunos = len(nomes)
total_alunos

400

In [24]:
nomes['id_aluno'] = np.random.permutation(total_alunos) + 1

In [25]:
nomes.sample(5)

          nome  id_aluno
188    POLIANA       369
57      DAIANE       303
3    FRANCISCO       382
182    CHARLES        33
30    ANDERSON       111

In [26]:
dominios = ['@dominiodoemail.com', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)

In [28]:
nomes.sample(5)

       nome  id_aluno              dominio
114  ARTHUR       320  @dominiodoemail.com
57   DAIANE       303  @servicodoemail.com
85   HELENA       221  @dominiodoemail.com
183   IRACI         8  @dominiodoemail.com
189   DALVA       137  @dominiodoemail.com

In [29]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [30]:
nomes.sample(5)

         nome  id_aluno              dominio                        email
59     ISABEL        83  @dominiodoemail.com    isabel@dominiodoemail.com
172    REBECA       165  @servicodoemail.com    rebeca@servicodoemail.com
130    JUNIOR       184  @dominiodoemail.com    junior@dominiodoemail.com
70    JOAQUIM       248  @servicodoemail.com   joaquim@servicodoemail.com
171  VALDEMIR         3  @dominiodoemail.com  valdemir@dominiodoemail.com